fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
/***************************************************************************
 *   Copyright (C) 2010, 2011, 2012, 2013, 2014 by Terraneo Federico       *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/

#include "stm32f2_f4_f7_sd.h"
#include "interfaces/bsp.h"
#include "interfaces/arch_registers.h"
#include "interfaces/interrupts.h"
#include "interfaces/cache.h"
#include "interfaces/delays.h"
#include "kernel/thread.h"
#include "board_settings.h" //For sdVoltage and SD_ONE_BIT_DATABUS definitions
#include <cstdio>
#include <cstring>
#include <errno.h>

//Note: enabling debugging might cause deadlock when using sleep() or reboot()
//The bug won't be fixed because debugging is only useful for driver development
///\internal Debug macro, for normal conditions
//#define DBG iprintf
#define DBG(x,...) do {} while(0)
///\internal Debug macro, for errors only
//#define DBGERR iprintf
#define DBGERR(x,...) do {} while(0)

/*
 * The SDMMC1 peripheral in the STM32F7 is basically the old SDIO with the
 * registers renamed and a few bits changed. Let's map the old names in the new
 */
#if defined(_CHIP_STM32F7)

#if SD_SDMMC==1
#define SDIO                 SDMMC1
#define RCC_APB2ENR_SDIOEN   RCC_APB2ENR_SDMMC1EN
#define SDIO_IRQn            SDMMC1_IRQn
#elif SD_SDMMC==2
#define SDIO                 SDMMC2
#define RCC_APB2ENR_SDIOEN   RCC_APB2ENR_SDMMC2EN
#define SDIO_IRQn            SDMMC2_IRQn
#else
#error SD_SDMMC undefined or not in range
#endif

#define SDIO_STA_STBITERR    0 //This bit has been removed
#define SDIO_STA_RXOVERR     SDMMC_STA_RXOVERR
#define SDIO_STA_TXUNDERR    SDMMC_STA_TXUNDERR
#define SDIO_STA_DTIMEOUT    SDMMC_STA_DTIMEOUT
#define SDIO_STA_DCRCFAIL    SDMMC_STA_DCRCFAIL
#define SDIO_STA_CMDSENT     SDMMC_STA_CMDSENT
#define SDIO_STA_CMDREND     SDMMC_STA_CMDREND
#define SDIO_STA_CCRCFAIL    SDMMC_STA_CCRCFAIL
#define SDIO_STA_CTIMEOUT    SDMMC_STA_CTIMEOUT
#define SDIO_STA_DATAEND     SDMMC_STA_DATAEND

#define SDIO_CMD_CPSMEN      SDMMC_CMD_CPSMEN
#define SDIO_CMD_WAITRESP_0  SDMMC_CMD_WAITRESP_0
#define SDIO_CMD_WAITRESP_1  SDMMC_CMD_WAITRESP_1

#define SDIO_ICR_CTIMEOUTC   SDMMC_ICR_CTIMEOUTC
#define SDIO_ICR_CCRCFAILC   SDMMC_ICR_CCRCFAILC

#define SDIO_CLKCR_CLKEN     SDMMC_CLKCR_CLKEN
#define SDIO_CLKCR_PWRSAV    SDMMC_CLKCR_PWRSAV
#define SDIO_CLKCR_WIDBUS_0  SDMMC_CLKCR_WIDBUS_0
#define SDIO_CLKCR_HWFC_EN   SDMMC_CLKCR_HWFC_EN

#define SDIO_MASK_STBITERRIE 0 //This bit has been removed
#define SDIO_MASK_RXOVERRIE  SDMMC_MASK_RXOVERRIE
#define SDIO_MASK_TXUNDERRIE SDMMC_MASK_TXUNDERRIE
#define SDIO_MASK_DCRCFAILIE SDMMC_MASK_DCRCFAILIE
#define SDIO_MASK_DTIMEOUTIE SDMMC_MASK_DTIMEOUTIE
#define SDIO_MASK_DATAENDIE  SDMMC_MASK_DATAENDIE

#define SDIO_DCTRL_DMAEN     SDMMC_DCTRL_DMAEN
#define SDIO_DCTRL_DTDIR     SDMMC_DCTRL_DTDIR
#define SDIO_DCTRL_DTEN      SDMMC_DCTRL_DTEN

#define SDIO_POWER_PWRCTRL_1 SDMMC_POWER_PWRCTRL_1
#define SDIO_POWER_PWRCTRL_0 SDMMC_POWER_PWRCTRL_0

constexpr int ICR_FLAGS_CLR=0x5ff;

#else  //defined(_CHIP_STM32F7)

constexpr int ICR_FLAGS_CLR=0x7ff;

#endif //defined(_CHIP_STM32F7)

#if defined(_CHIP_STM32F7)&& SD_SDMMC==2
#define DMA_Stream           DMA2_Stream0
#else
#define DMA_Stream           DMA2_Stream3
#endif

namespace miosix {

static volatile bool driverError;       ///< \internal Errors caused by OS issues (premature wakeup)
static volatile bool dmaTransferError;  ///< \internal DMA transfer error
static volatile bool sdioTransferError; ///< \internal SDIO transfer error
static volatile bool dmaDone;           ///< \internal DMA TC received (no error) — read path
static volatile bool sdioDone;          ///< \internal SDIO DATAEND received (no error)
static volatile bool waitForDma;        ///< \internal Read path: require both DMA TC and SDIO DATAEND
static Thread *waiting;                 ///< \internal Thread waiting for transfer
static unsigned int dmaFlags;           ///< \internal DMA status flags
static unsigned int sdioFlags;          ///< \internal SDIO status flags

/**
 * \internal
 * Called from ISR context only. Wakes the waiting thread when the transfer is
 * fully complete (or on any error). For reads (waitForDma==true), both DMA TC
 * and SDIO DATAEND must have been observed; for writes, SDIO DATAEND alone suffices.
 */
inline static void maybeWakeWaitingThread()
{
    if(!waiting) return;
    bool ready = waitForDma ? (dmaDone && sdioDone) : sdioDone;
    if(ready || dmaTransferError || sdioTransferError)
    {
        waiting->IRQwakeup();
        waiting=nullptr;
    }
}

/**
 * \internal
 * DMA2 Stream3 interrupt handler actual implementation
 */
void SDDMAirqImpl()
{
    dmaFlags=DMA2->LISR;
    #if defined(_CHIP_STM32F7) && SD_SDMMC==2
    if(dmaFlags & (DMA_LISR_TEIF0 | DMA_LISR_DMEIF0 | DMA_LISR_FEIF0))
        dmaTransferError=true;
    else
        dmaDone=true;

