fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
    DMA2->LIFCR = DMA_LIFCR_CTCIF0
                | DMA_LIFCR_CTEIF0
                | DMA_LIFCR_CDMEIF0
                | DMA_LIFCR_CFEIF0;
    #else
    if(dmaFlags & (DMA_LISR_TEIF3 | DMA_LISR_DMEIF3 | DMA_LISR_FEIF3))
        dmaTransferError=true;
    else
        dmaDone=true;

    DMA2->LIFCR = DMA_LIFCR_CTCIF3
                | DMA_LIFCR_CTEIF3
                | DMA_LIFCR_CDMEIF3
                | DMA_LIFCR_CFEIF3;
    #endif

    maybeWakeWaitingThread();
}

/**
 * \internal
 * SDIO device interrupt handler actual implementation
 */
void SDirqImpl()
{
    sdioFlags=SDIO->STA;

    #ifdef SDIO_STA_STBITERR
    //Some STM32 chips leave this flag reserved, in that case it's left
    //undefined in the CMSIS headers
    if(sdioFlags & SDIO_STA_STBITERR)
        sdioTransferError=true;
    #endif
    if(sdioFlags & (SDIO_STA_RXOVERR  | SDIO_STA_TXUNDERR | 
                    SDIO_STA_DTIMEOUT | SDIO_STA_DCRCFAIL))
        sdioTransferError=true;
    // Latch DATAEND separately; set only when no error flag is present so that
    // maybeWakeWaitingThread() can distinguish success from failure cleanly.
    if(!sdioTransferError && (sdioFlags & SDIO_STA_DATAEND))
        sdioDone=true;

    SDIO->ICR=ICR_FLAGS_CLR; //Clear flags

    maybeWakeWaitingThread();
}

/*
 * Operating voltage of device. It is sent to the SD card to check if it can
 * work at this voltage. Range *must* be within 28..36
 * Example 33=3.3v
 */
//static const unsigned char sdVoltage=33; //Is defined in board_settings.h
static const unsigned int sdVoltageMask=1<<(sdVoltage-13); //See OCR reg in SD spec

/**
 * \internal
 * Possible state of the cardType variable.
 */
enum CardType
{
    Invalid=0, ///<\internal Invalid card type
    MMC=1<<0,  ///<\internal if(cardType==MMC) card is an MMC
    SDv1=1<<1, ///<\internal if(cardType==SDv1) card is an SDv1
    SDv2=1<<2, ///<\internal if(cardType==SDv2) card is an SDv2
    SDHC=1<<3  ///<\internal if(cardType==SDHC) card is an SDHC
};

///\internal Type of card.
static CardType cardType=Invalid;

//SD card GPIOs
//TODO: expose gpio selection to the BSPs...
#if defined(_CHIP_STM32F7) && SD_SDMMC==2
typedef Gpio<PG,9>  sdD0;
typedef Gpio<PG,10> sdD1;
typedef Gpio<PB,3>  sdD2;
typedef Gpio<PB,4>  sdD3;
typedef Gpio<PD,6>  sdCLK;
typedef Gpio<PD,7>  sdCMD;
#elif defined(_BOARD_STM32F411CE_BLACKPILL)
typedef Gpio<PB,4>  sdD0;
typedef Gpio<PC,9>  sdD1;
typedef Gpio<PC,10> sdD2;
typedef Gpio<PC,11> sdD3;
typedef Gpio<PB,15> sdCLK;
typedef Gpio<PA,6>  sdCMD;
#else
typedef Gpio<PC,8>  sdD0;
typedef Gpio<PC,9>  sdD1;
typedef Gpio<PC,10> sdD2;
typedef Gpio<PC,11> sdD3;
typedef Gpio<PC,12> sdCLK;
typedef Gpio<PD,2>  sdCMD;
#endif


//
// Class BufferConverter
//

/**
 * \internal
 * After fixing the FSMC bug in the stm32f1, ST decided to willingly introduce
 * another quirk in the stm32f4. They introduced a core coupled memory that is
 * not accessible by the DMA. While from an hardware perspective it may make
 * sense, it is a bad design decision when viewed from the software side.
 * This is because if application code allocates a buffer in the core coupled
 * memory and passes that to an fread() or fwrite() call, that buffer is
 * forwarded here, and this driver is DMA-based... Now, in an OS such as Miosix
 * that tries to shield the application developer from such quirks, it is
 * unacceptable to fail to work in such an use case, so this class exists to
 * try and work around this.
 * In essence, the first "bad buffer" that is passed to a readBlock() or
 * writeBlock() causes the allocation on the heap (which Miosix guarantees
 * is not allocated in the core coupled memory) of a 512 byte buffer which is
 * then never deallocated and always reused to deal with these bad buffers.
 * While this works, performance suffers for two reasons: first, when dealing
 * with those bad buffers, the filesystem code is no longer zero copy, and
 * second because multiple block read/writes between bad buffers and the SD
 * card are implemented as a sequence of single block read/writes.
 * If you're an application developer and care about speed, try to allocate
 * your buffers in the heap if you're coding for the STM32F4.
 */
class BufferConverter
{
public:
    /**
     * \internal
     * The buffer will be of this size only.
     */
    static const int BUFFER_SIZE=512;

    /**
     * \internal
     * \return true if the pointer is not inside the CCM
     */
    static bool isGoodBuffer(const void *x)
    {
        unsigned int ptr=reinterpret_cast<const unsigned int>(x);
        return (ptr<0x10000000) || (ptr>=(0x10000000+64*1024));
    }

    /**
     * \internal
     * Convert from a constunsigned char* buffer of size BUFFER_SIZE to a
     * const unsigned int* word aligned buffer.
     * If the original buffer is already word aligned it only does a cast,
     * otherwise it copies the data on the original buffer to a word aligned
     * buffer. Useful if subseqent code will read from the buffer.
     * \param a buffer of size BUFFER_SIZE. Can be word aligned or not.
     * \return a word aligned buffer with the same data of the given buffer
     */
    static const unsigned char *toWordAligned(const unsigned char *buffer);

    /**
     * \internal
     * Convert from an unsigned char* buffer of size BUFFER_SIZE to an
     * unsigned int* word aligned buffer.
     * If the original buffer is already word aligned it only does a cast,
     * otherwise it returns a new buffer which *does not* contain the data
     * on the original buffer. Useful if subseqent code will write to the
     * buffer. To move the written data to the original buffer, use
     * toOriginalBuffer()
     * \param a buffer of size BUFFER_SIZE. Can be word aligned or not.
     * \return a word aligned buffer with undefined content.
     */
    static unsigned char *toWordAlignedWithoutCopy(unsigned char *buffer);

    /**
     * \internal
     * Convert the buffer got through toWordAlignedWithoutCopy() to the
     * original buffer. If the original buffer was word aligned, nothing
     * happens, otherwise a memcpy is done.
     * Note that this function does not work on buffers got through
     * toWordAligned().
     */
    static void toOriginalBuffer();

    /**
     * \internal
     * Can be called to deallocate the buffer
     */
    static void deallocateBuffer();

