fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
private:
    static unsigned char *originalBuffer;
    static unsigned char *wordAlignedBuffer;
};

const unsigned char *BufferConverter::toWordAligned(const unsigned char *buffer)
{
    originalBuffer=0; //Tell toOriginalBuffer() that there's nothing to do
    if(isGoodBuffer(buffer))
    {
        return buffer;
    } else {
        if(wordAlignedBuffer==0)
            wordAlignedBuffer=new unsigned char[BUFFER_SIZE];
        std::memcpy(wordAlignedBuffer,buffer,BUFFER_SIZE);
        return wordAlignedBuffer;
    }
}

unsigned char *BufferConverter::toWordAlignedWithoutCopy(
    unsigned char *buffer)
{
    if(isGoodBuffer(buffer))
    {
        originalBuffer=0; //Tell toOriginalBuffer() that there's nothing to do
        return buffer;
    } else {
        originalBuffer=buffer; //Save original pointer for toOriginalBuffer()
        if(wordAlignedBuffer==0)
            wordAlignedBuffer=new unsigned char[BUFFER_SIZE];
        return wordAlignedBuffer;
    }
}

void BufferConverter::toOriginalBuffer()
{
    if(originalBuffer==0) return;
    std::memcpy(originalBuffer,wordAlignedBuffer,BUFFER_SIZE);
    originalBuffer=0;
}

void BufferConverter::deallocateBuffer()
{
    originalBuffer=0; //Invalidate also original buffer
    if(wordAlignedBuffer!=0)
    {
        delete[] wordAlignedBuffer;
        wordAlignedBuffer=0;
    }
}

unsigned char *BufferConverter::originalBuffer=0;
unsigned char *BufferConverter::wordAlignedBuffer=0;


// 
// enum CommandType
// 

/**
 * \internal
 * SD/MMC commands
 * - bit #7 is @ 1 if a command is an ACMDxx. send() will send the
 *   sequence CMD55, CMDxx
 * - bit from #0 to #5 indicate command index (CMD0..CMD63)
 * - bit #6 is don't care
 */
enum class CommandType
{
    CMD0=0,           //GO_IDLE_STATE
    CMD2=2,           //ALL_SEND_CID
    CMD3=3,           //SEND_RELATIVE_ADDR
    ACMD6=0x80 | 6,   //SET_BUS_WIDTH
    CMD7=7,           //SELECT_DESELECT_CARD
    ACMD41=0x80 | 41, //SEND_OP_COND (SD)
    CMD8=8,           //SEND_IF_COND
    CMD9=9,           //SEND_CSD
    CMD12=12,         //STOP_TRANSMISSION
    CMD13=13,         //SEND_STATUS
    CMD16=16,         //SET_BLOCKLEN
    CMD17=17,         //READ_SINGLE_BLOCK
    CMD18=18,         //READ_MULTIPLE_BLOCK
    ACMD23=0x80 | 23, //SET_WR_BLK_ERASE_COUNT (SD)
    CMD24=24,         //WRITE_BLOCK
    CMD25=25,         //WRITE_MULTIPLE_BLOCK
    CMD55=55          //APP_CMD
};

//
// Class CmdResult
//

/**
 * \internal
 * Contains the result of an SD/MMC command
 */
class CmdResult
{
public:

    /**
     * \internal
     * Possible outcomes of sending a command
     */
    enum Error
    {
        Ok=0,        /// No errors
        Timeout,     /// Timeout while waiting command reply
        CRCFail,     /// CRC check failed in command reply
        RespNotMatch,/// Response index does not match command index
        ACMDFail     /// Sending CMD55 failed
    };

    /**
     * \internal
     * Default constructor
     */
    CmdResult(): cmd(CommandType::CMD0), error(Ok), response{0, 0, 0, 0} {}

    /**
     * \internal
     * Constructor,  set the response data
     * \param cmd command index of command that was sent
     * \param result result of command
     */
    CmdResult(CommandType cmd, Error error): cmd(cmd), error(error)
    {
        if(cmd==CommandType::CMD9) 
        {
            response[0]=SDIO->RESP4;
            response[1]=SDIO->RESP3;
            response[2]=SDIO->RESP2;
            response[3]=SDIO->RESP1;
        } else {
            response[0]=SDIO->RESP1;           
        }
    }

    /**
     * \internal
     * \return the 32 bit of the response.
     * May not be valid if getError()!=Ok or the command does not send a
     * response, such as CMD0
     */
    unsigned int getShortResponse() { return response[0]; }

    /**
     * \internal
     * \param part one of the four 32 bit parts of the 128 bit response
     * \return the part selected with the part parameter or 0 if out of bounds
     */
    unsigned int getLongResponsePart(size_t part)
    {
        if(part>=4) return 0;
        return response[part];
    }

    /**
     * \internal
     * \return the error flags of the response
     */
    Error getError() { return error; }

    /**
     * \internal
     * Checks if errors occurred while sending the command.
     * \return true if no errors, false otherwise
     */
    bool validateError();

    /**
     * \internal
     * interprets this->getShortResponse() as an R1 response, and checks if there are
     * errors, or everything is ok
     * \return true on success, false on failure
     */
    bool validateR1Response();

    /**
     * \internal
     * Same as validateR1Response, but can be called with interrupts disabled.
     * \return true on success, false on failure
     */
    bool IRQvalidateR1Response();

    /**
     * \internal checks if there was an error during long response exchange.
     * R2 responses can never generate RespNotMatch error.
     * \return true on success, false on any error
     */
    bool validateR2Response();

    /**
     * \internal
     * interprets this->getShortResponse() as an R6 response, and checks if there are
     * errors, or everything is ok
     * \return true on success, false on failure
     */
    bool validateR6Response();

    /**
     * \internal
     * \return the card state from an R1 or R6 resonse
     */
    unsigned char getState();

private:
    CommandType cmd; ///<\internal Command index that was sent
    Error error; ///<\internal possible error that occurred
    unsigned int response[4]; ///<\internal 32/128bit response
};

bool CmdResult::validateError()
{
    switch(error)
    {
        case Ok:
            return true;
        case Timeout:
            DBGERR("CMD%u: Timeout\n",static_cast<unsigned char>(cmd));
            break;
        case CRCFail:
            DBGERR("CMD%u: CRC Fail\n",static_cast<unsigned char>(cmd));
            break;
        case RespNotMatch:
            DBGERR("CMD%u: Response does not match\n",static_cast<unsigned char>(cmd));
            break;
        case ACMDFail:
            DBGERR("CMD%u: ACMD Fail\n",static_cast<unsigned char>(cmd));
            break;
    }
    return false;
}

bool CmdResult::validateR1Response()
{
    if(error!=Ok) return validateError();
    //Note: this number is obtained with all the flags of R1 which are errors
    //(flagged as E in the SD specification), plus CARD_IS_LOCKED because
    //locked card are not supported by this software driver
    if((response[0] & 0xfff98008)==0) return true;
    DBGERR("CMD%u: R1 response error(s):\n",static_cast<unsigned char>(cmd));
    if(response[0] & (1<<31)) DBGERR("Out of range\n");
    if(response[0] & (1<<30)) DBGERR("ADDR error\n");
    if(response[0] & (1<<29)) DBGERR("BLOCKLEN error\n");
    if(response[0] & (1<<28)) DBGERR("ERASE SEQ error\n");
    if(response[0] & (1<<27)) DBGERR("ERASE param\n");
    if(response[0] & (1<<26)) DBGERR("WP violation\n");
    if(response[0] & (1<<25)) DBGERR("card locked\n");
    if(response[0] & (1<<24)) DBGERR("LOCK_UNLOCK failed\n");
    if(response[0] & (1<<23)) DBGERR("command CRC failed\n");
    if(response[0] & (1<<22)) DBGERR("illegal command\n");
    if(response[0] & (1<<21)) DBGERR("ECC fail\n");
    if(response[0] & (1<<20)) DBGERR("card controller error\n");
    if(response[0] & (1<<19)) DBGERR("unknown error\n");
    if(response[0] & (1<<16)) DBGERR("CSD overwrite\n");
    if(response[0] & (1<<15)) DBGERR("WP ERASE skip\n");
    if(response[0] & (1<<3)) DBGERR("AKE_SEQ error\n");
    return false;
}

