fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
bool CmdResult::IRQvalidateR1Response()
{
    if(error!=Ok) return false;
    if(response[0] & 0xfff98008) return false;
    return true;
}

bool CmdResult::validateR2Response() {
    // R2 responses do not contain cmd index so it is always wrong
    if(error!=Ok) return validateError();

    return true;
}

bool CmdResult::validateR6Response()
{
    if(error!=Ok) return validateError();
    if((response[0] & 0xe008)==0) return true;
    DBGERR("CMD%u: R6 response error(s):\n",static_cast<unsigned char>(cmd));
    if(response[0] & (1<<15)) DBGERR("command CRC failed\n");
    if(response[0] & (1<<14)) DBGERR("illegal command\n");
    if(response[0] & (1<<13)) DBGERR("unknown error\n");
    if(response[0] & (1<<3)) DBGERR("AKE_SEQ error\n");
    return false;
}

unsigned char CmdResult::getState()
{
    unsigned char result=(response[0]>>9) & 0xf;
    DBG("CMD%u: State: ",static_cast<unsigned char>(cmd));
    switch(result)
    {
        case 0:  DBG("Idle\n");  break;
        case 1:  DBG("Ready\n"); break;
        case 2:  DBG("Ident\n"); break;
        case 3:  DBG("Stby\n"); break;
        case 4:  DBG("Tran\n"); break;
        case 5:  DBG("Data\n"); break;
        case 6:  DBG("Rcv\n"); break;
        case 7:  DBG("Prg\n"); break;
        case 8:  DBG("Dis\n"); break;
        case 9:  DBG("Btst\n"); break;
        default: DBG("Unknown\n"); break;
    }
    return result;
}

//
// Class Command
//

/**
 * \internal
 * This class allows sending commands to an SD or MMC
 */
class Command
{
public:

    /**
     * \internal
     * Send a command.
     * \param cmd command index (CMD0..CMD63) or ACMDxx command
     * \param arg the 32 bit argument to the command
     * \return a CmdResult object
     */
    static CmdResult send(CommandType cmd, unsigned int arg);

    /**
     * \internal
     * Set the relative card address, obtained during initialization.
     * \param r the card's rca
     */
    static void setRca(unsigned short r) { rca=r; }

    /**
     * \internal
     * \return the card's rca, as set by setRca
     */
    static unsigned int getRca() { return static_cast<unsigned int>(rca); }

private:
    static unsigned short rca;///<\internal Card's relative address
};

CmdResult Command::send(CommandType cmd, unsigned int arg)
{
    unsigned char cc=static_cast<unsigned char>(cmd);
    //Handle ACMDxx as CMD55, CMDxx
    if(cc & 0x80)
    {
        cc &= 0x3f;
        cmd=static_cast<CommandType>(cc);
        DBG("ACMD%u\n",cc);
        CmdResult r=send(CommandType::CMD55,(static_cast<unsigned int>(rca))<<16);
        if(r.validateR1Response()==false)
            return CmdResult(cmd,CmdResult::ACMDFail);
        //Bit 5 @ 1 = next command will be interpreted as ACMD
        if((r.getShortResponse() & (1<<5))==0)
            return CmdResult(cmd,CmdResult::ACMDFail);
    } else DBG("CMD%u\n",cc);

    //Send command
    unsigned int command=SDIO_CMD_CPSMEN | static_cast<unsigned int>(cc);
    if(cmd!=CommandType::CMD0) command |= SDIO_CMD_WAITRESP_0; //CMD0 has no response
    if(cmd==CommandType::CMD2) command |= SDIO_CMD_WAITRESP_1; //CMD2 has long response
    if(cmd==CommandType::CMD9) command |= SDIO_CMD_WAITRESP_1; //CMD9 has long response
    SDIO->ARG=arg;
    SDIO->CMD=command;

    //CMD0 has no response, so wait until it is sent
    if(cmd==CommandType::CMD0)
    {
        for(int i=0;i<500;i++)
        {
            if(SDIO->STA & SDIO_STA_CMDSENT)
            {
                SDIO->ICR=ICR_FLAGS_CLR;//Clear flags
                return CmdResult(cmd,CmdResult::Ok);
            }
            delayUs(1);
        }
        SDIO->ICR=ICR_FLAGS_CLR;//Clear flags
        return CmdResult(cmd,CmdResult::Timeout);
    }

    //Command is not CMD0, so wait a reply
    for(int i=0;i<500;i++)
    {
        unsigned int status=SDIO->STA;
        if(status & SDIO_STA_CMDREND)
        {
            SDIO->ICR=ICR_FLAGS_CLR;//Clear flags
            auto responseCmd = SDIO->RESPCMD;
            //NOTE: CMD2 and CMD9 return long response and don't set RESPCMD
            if(responseCmd==cc || cmd==CommandType::CMD2 || cmd==CommandType::CMD9)
            {
                return CmdResult(cmd,CmdResult::Ok);
            } else {
                DBGERR("CMD%u: Response index does not match. Got %lu\n",cc,responseCmd);
                return CmdResult(cmd,CmdResult::RespNotMatch);
            }
        }
        if(status & SDIO_STA_CCRCFAIL)
        {
            SDIO->ICR=SDIO_ICR_CCRCFAILC;
            return CmdResult(cmd,CmdResult::CRCFail);
        }
        if(status & SDIO_STA_CTIMEOUT) break;
        delayUs(1);
    }
    SDIO->ICR=SDIO_ICR_CTIMEOUTC;
    return CmdResult(cmd,CmdResult::Timeout);
}

unsigned short Command::rca=0;

//
// Class ClockController
//

/**
 * \internal
 * This class controls the clock speed of the SDIO peripheral. It originated
 * from a previous version of this driver, where the SDIO was used in polled
 * mode instead of DMA mode, but has been retained to improve the robustness
 * of the driver.
 */
class ClockController
{
public:

    /**
     * \internal. Set a low clock speed of 400KHz or less, used for
     * detecting SD/MMC cards. This function as a side effect enables 1bit bus
     * width, and disables clock powersave, since it is not allowed by SD spec.
     */
    static void setLowSpeedClock()
    {
        clockReductionAvailable=0;
        // No hardware flow control, SDIO_CK generated on rising edge, 1bit bus
        // width, no clock bypass, no powersave.
        // Set low clock speed 400KHz
        SDIO->CLKCR=CLOCK_400KHz | SDIO_CLKCR_CLKEN;
        SDIO->DTIMER=240000; //Timeout 600ms expressed in SD_CK cycles
    }

    /**
     * \internal
     * Automatically select the data speed. This routine selects the highest
     * sustainable data transfer speed by binary search and accepts a candidate
     * speed only if repeated block reads succeed and return the expected
     * payload.
     *
     * As a side effect, this function enables 4bit bus width and clock
     * powersave.
     */
    static bool calibrateClockSpeed(SDIODriver *sdio);

    /**
     * \internal
     * Reduce the SDIO clock slightly after calibration.
     * This helper is only used later, during normal operation, if a transfer
     * error suggests that the selected speed is marginally too high.
     * Since clock speed is chosen dynamically at runtime, a corner case might
     * be that of a speed which works most of the time but occasionally fails.
     * For maximum robustness, this function is provided to reduce the clock
     * speed slightly in case a data transfer should fail after clock
     * calibration. To avoid inadvertently considering other kind of issues as
     * clock issues, this function can be called only MAX_ALLOWED_REDUCTIONS
     * times after clock calibration, subsequent calls will fail. This will
     * avoid other issues causing an ever decreasing clock speed.
     * \return true on success, false on failure
     */
    static bool reduceClockSpeed();

    /**
     * \internal
     * Read and write operations retry during normal use for robustness. During
     * speed probing each read uses a single attempt, so calibration does not
     * accept a marginal clock just because a later retry happened to succeed.
     */
    static unsigned char getRetryCount() { return retries; }

