fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
private:
    /**
     * Set SDIO clock speed
     * \param clkdiv speed is SDIOCLK/(clkdiv+2) 
     */
    static void setClockSpeed(unsigned int clkdiv);
    
    static const unsigned int SDIOCLK=48000000; //On stm32f2 SDIOCLK is always 48MHz
    static const unsigned int CLOCK_400KHz=118; //48MHz/(118+2)=400KHz
    #ifdef OVERRIDE_SD_CLOCK_DIVIDER_MAX
    //Some boards using SDRAM cause SDIO TX Underrun occasionally
    static const unsigned int CLOCK_MAX=OVERRIDE_SD_CLOCK_DIVIDER_MAX;
    #else //OVERRIDE_SD_CLOCK_DIVIDER_MAX
    static const unsigned int CLOCK_MAX=0;      //48MHz/(0+2)  =24MHz
    #endif //OVERRIDE_SD_CLOCK_DIVIDER_MAX

    #ifdef SD_ONE_BIT_DATABUS
    ///\internal Clock enabled, bus width 1bit, clock powersave enabled.
    static const unsigned int CLKCR_FLAGS=SDIO_CLKCR_CLKEN | SDIO_CLKCR_PWRSAV;
    #else //SD_ONE_BIT_DATABUS
    ///\internal Clock enabled, bus width 4bit, clock powersave enabled.
    static const unsigned int CLKCR_FLAGS=SDIO_CLKCR_CLKEN |
        SDIO_CLKCR_WIDBUS_0 | SDIO_CLKCR_PWRSAV;
    #endif //SD_ONE_BIT_DATABUS

    ///\internal Maximum number of calls to IRQreduceClockSpeed() allowed
    static const unsigned char MAX_ALLOWED_REDUCTIONS=1;

    ///\internal value returned by getRetryCount() while *not* calibrating clock.
    static const unsigned char MAX_RETRY=10;

    ///\internal Used to allow only one call to reduceClockSpeed()
    static unsigned char clockReductionAvailable;

    ///\internal value returned by getRetryCount()
    static unsigned char retries;
};

bool ClockController::calibrateClockSpeed(SDIODriver *sdio)
{
    // During calibration we call readBlock(), which can request clock
    // reduction after transfer errors. Keep it disabled while searching or the
    // calibration result would become self-invalidating.
    clockReductionAvailable=0;

    DBG("Automatic speed calibration\n");
    unsigned int reference[512/sizeof(unsigned int)];
    unsigned int probe[512/sizeof(unsigned int)];
    unsigned int minFreq=CLOCK_400KHz;
    unsigned int maxFreq=CLOCK_MAX;
    unsigned int selected;
    bool success=false;
    const unsigned char calibrationProbeReads=2;

    // First capture a known-good reference block at 400kHz. Some unstable
    // speeds can complete a transfer without protocol errors while still
    // returning corrupted payload, so calibration must validate data too.
    // This low-speed reference read may use normal retries because it is
    // not testing the upper bus-speed limit.
    setClockSpeed(minFreq);
    retries=MAX_RETRY;
    if(sdio->readBlock(reinterpret_cast<unsigned char*>(reference),512,0)!=512)
    {
        clockReductionAvailable=MAX_ALLOWED_REDUCTIONS;
        return false;
    }

    // Candidate reads must be single-shot and repeated explicitly: accepting a
    // speed because one retry succeeded would select a marginal clock, while a
    // single successful read would not prove that the selected clock is stable.
    retries=1;
    auto clockCandidateIsStable=[&]() {
        for(unsigned int i=0;i<calibrationProbeReads;i++)
        {
            if(sdio->readBlock(reinterpret_cast<unsigned char*>(probe),512,0)!=512
            || std::memcmp(probe, reference, sizeof(reference))!=0)
                return false;
        }
        return true;
    };

    while(minFreq-maxFreq>1)
    {
        selected=(minFreq+maxFreq)/2;
        DBG("Trying CLKCR=%d\n",selected);
        setClockSpeed(selected);
        if(clockCandidateIsStable()) minFreq=selected;
        else maxFreq=selected;
    }
    //Last round of algorithm
    setClockSpeed(maxFreq);
    success=clockCandidateIsStable();
    if(success)
    {
        DBG("Optimal CLKCR=%d\n",maxFreq);
    } else {
        setClockSpeed(minFreq);
        success=clockCandidateIsStable();
        if(success) DBG("Optimal CLKCR=%d\n",minFreq);
        else DBGERR("Automatic speed calibration failed\n");
    }

    clockReductionAvailable=MAX_ALLOWED_REDUCTIONS;
    retries=MAX_RETRY;
    return success;
}

bool ClockController::reduceClockSpeed()
{
    DBGERR("clock speed reduction requested\n");
    //Ensure this function can be called only a few times
    if(clockReductionAvailable==0) return false;
    clockReductionAvailable--;

    unsigned int currentClkcr=SDIO->CLKCR & 0xff;
    if(currentClkcr==CLOCK_400KHz) return false; //No lower than this value

    //If the value of clockcr is low, increasing it by one is enough since
    //frequency changes a lot, otherwise increase by 2.
    if(currentClkcr<10) currentClkcr++;
    else currentClkcr+=2;

    setClockSpeed(currentClkcr);
    return true;
}

void ClockController::setClockSpeed(unsigned int clkdiv)
{
    #ifndef SD_KEEP_CARD_SELECTED
    SDIO->CLKCR=clkdiv | CLKCR_FLAGS;
    #else //SD_KEEP_CARD_SELECTED
    SDIO->CLKCR=clkdiv | CLKCR_FLAGS | SDIO_CLKCR_HWFC_EN;
    #endif //SD_KEEP_CARD_SELECTED
    //Timeout 600ms expressed in SD_CK cycles
    SDIO->DTIMER=(6*SDIOCLK)/((clkdiv+2)*10);
}

unsigned char ClockController::clockReductionAvailable=false;
unsigned char ClockController::retries=ClockController::MAX_RETRY;

//
// Data send/receive functions
//

/**
 * \internal
 * Wait until the card is ready for data transfer.
 * Can be called independently of the card being selected.
 * \return true on success, false on failure
 */
static bool waitForCardReady()
{
    //The card may remain busy for up to 500ms and there appears to be no way
    //to set an interrupt to wait until it becomes ready again. We can't just
    //poll for that long as if a high priority thread is stuck polling all lower
    //priority threads block, so we are forced to do a sleep. The initial value
    //of 2ms was found to be impacting performance excessively, so we take
    //advantage of high resolution timers by sleeping for 200us, and fallback to
    //the previous value only for slow configurations
    #if !defined(__CODE_IN_XRAM)
    const long long sleepTime=200000;
    #else
    const long long sleepTime=2000000;
    #endif
    long long timeout=getTime()+1500000000; //Timeout 1.5 second
    do {
        CmdResult cr=Command::send(CommandType::CMD13,Command::getRca()<<16);
        if(cr.validateR1Response()==false) return false;
        //Bit 8 in R1 response means ready for data.
        if(cr.getShortResponse() & (1<<8)) return true;
        Thread::nanoSleep(sleepTime);
    } while(getTime()<timeout);
    DBGERR("Timeout waiting card ready\n");
    return false;
}

/**
 * \internal
 * Prints the errors that may occur during a DMA transfer
 */
static void displayBlockTransferError()
{
    DBGERR("Block transfer error\n");
    if(dmaFlags & DMA_LISR_TEIF3)     DBGERR("* DMA Transfer error\n");
    if(dmaFlags & DMA_LISR_DMEIF3)    DBGERR("* DMA Direct mode error\n");
    if(dmaFlags & DMA_LISR_FEIF3)     DBGERR("* DMA Fifo error\n");
    #ifdef SDIO_STA_STBITERR
    if(sdioFlags & SDIO_STA_STBITERR) DBGERR("* SDIO Start bit error\n");
    #endif
    if(sdioFlags & SDIO_STA_RXOVERR)  DBGERR("* SDIO RX Overrun\n");
    if(sdioFlags & SDIO_STA_TXUNDERR) DBGERR("* SDIO TX Underrun error\n");
    if(sdioFlags & SDIO_STA_DCRCFAIL) DBGERR("* SDIO Data CRC fail\n");
    if(sdioFlags & SDIO_STA_DTIMEOUT) DBGERR("* SDIO Data timeout\n");
}

/**
 * \internal
 * Contains initial common code between multipleBlockRead and multipleBlockWrite
 * to clear interrupt and error flags, set the waiting thread and compute the
 * memory transfer size based on buffer alignment
 * \return the best DMA transfer size for a given buffer alignment 
 */
static unsigned int dmaTransferCommonSetup(const unsigned char *buffer, bool readMode=false)
{
    //Clear both SDIO and DMA interrupt flags
    SDIO->ICR=ICR_FLAGS_CLR;
    #if defined(_CHIP_STM32F7) && SD_SDMMC==2
    DMA2->LIFCR = DMA_LIFCR_CTCIF0
                | DMA_LIFCR_CTEIF0
                | DMA_LIFCR_CDMEIF0
                | DMA_LIFCR_CFEIF0;
    #else
    DMA2->LIFCR = DMA_LIFCR_CTCIF3
                | DMA_LIFCR_CTEIF3
                | DMA_LIFCR_CDMEIF3
                | DMA_LIFCR_CFEIF3;
    #endif

