fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
    driverError=false;
    dmaTransferError=false;
    sdioTransferError=false;
    dmaDone=false;
    sdioDone=false;
    waitForDma=readMode;
    dmaFlags=sdioFlags=0;
    waiting=Thread::getCurrentThread();
    
    //Select DMA transfer size based on buffer alignment. Best performance
    //is achieved when the buffer is aligned on a 4 byte boundary
    switch(reinterpret_cast<unsigned int>(buffer) & 0x3)
    {
        case 0:  return DMA_SxCR_MSIZE_1; //DMA reads 32bit at a time
        case 2:  return DMA_SxCR_MSIZE_0; //DMA reads 16bit at a time
        default: return 0;                //DMA reads  8bit at a time
    }
}

/**
 * \internal
 * Read a given number of contiguous 512 byte blocks from an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes
 * \param nblk number of blocks to read.
 * \param lba logical block address of the first block to read.
 */
static bool multipleBlockRead(unsigned char *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    while(nblk>32767)
    {
        if(multipleBlockRead(buffer,32767,lba)==false) return false;
        buffer+=32767*512;
        nblk-=32767;
        lba+=32767;
    }
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    
    unsigned int memoryTransferSize=dmaTransferCommonSetup(buffer, true /*read mode*/);

    // Thread is woken only when BOTH DMA TC (dmaDone) AND SDIO DATAEND (sdioDone)
    // have been observed, or on any error. This eliminates the race where DMA TC
    // fires before the SDIO CRC16 check has completed.
    int32_t t=SDIO_MASK_DATAENDIE  | //Interrupt on data end (CRC passed)
              SDIO_MASK_RXOVERRIE  | //Interrupt on rx overrun
              SDIO_MASK_TXUNDERRIE | //Interrupt on tx underrun
              SDIO_MASK_DCRCFAILIE | //Interrupt on data CRC fail
              SDIO_MASK_DTIMEOUTIE;  //Interrupt on data timeout
    #ifdef SDIO_MASK_STBITERRIE
    t|=SDIO_MASK_STBITERRIE; //Interrupt on start bit error
    #endif
    SDIO->MASK=t;
    DMA_Stream->PAR=reinterpret_cast<unsigned int>(&SDIO->FIFO);
    DMA_Stream->M0AR=reinterpret_cast<unsigned int>(buffer);
    //Note: DMA_Stream->NDTR is don't care in peripheral flow control mode
    DMA_Stream->FCR = DMA_SxFCR_FEIE   //Interrupt on fifo error
                    | DMA_SxFCR_DMDIS  //Fifo enabled
                    | DMA_SxFCR_FTH_0; //Take action if fifo half full
    #if defined(_CHIP_STM32F7) && SD_SDMMC==2
    DMA_Stream->CR = (11 << DMA_SxCR_CHSEL_Pos) //Channel 4 (SDIO)
    #else
    DMA_Stream->CR = DMA_SxCR_CHSEL_2   //Channel 4 (SDIO)
    #endif
                   | DMA_SxCR_PBURST_0  //4-beat bursts read from SDIO
                   | DMA_SxCR_PL_0      //Medium priority DMA stream
                   | memoryTransferSize //RAM data size depends on alignment
                   | DMA_SxCR_PSIZE_1   //Read 32bit at a time from SDIO
                   | DMA_SxCR_MINC      //Increment RAM pointer
                   | 0                  //Peripheral to memory direction
                   | DMA_SxCR_PFCTRL    //Peripheral is flow controller
                   | DMA_SxCR_TCIE      //Interrupt on transfer complete
                   | DMA_SxCR_TEIE      //Interrupt on transfer error
                   | DMA_SxCR_DMEIE     //Interrupt on direct mode error
                   | DMA_SxCR_EN;       //Start the DMA
    
    SDIO->DLEN=nblk*512;
    if(waiting==0)
    {
        DBGERR("Premature wakeup\n");
        driverError=true;
    }
    CmdResult cr=Command::send(nblk>1 ? CommandType::CMD18 : CommandType::CMD17,lba);
    if(cr.validateR1Response())
    {
        //Block size 512 bytes, block data xfer, from card to controller
        SDIO->DCTRL=(9<<4) | SDIO_DCTRL_DMAEN | SDIO_DCTRL_DTDIR | SDIO_DCTRL_DTEN;
        FastGlobalIrqLock dLock;
        while(waiting) Thread::IRQglobalIrqUnlockAndWait(dLock);
    } else sdioTransferError=true;
    DMA_Stream->CR=0;
    while(DMA_Stream->CR & DMA_SxCR_EN) ; //DMA may take time to stop
    SDIO->DCTRL=0; //Disable data path state machine
    SDIO->MASK=0;

    // CMD12 is sent to end CMD18 (multiple block read), or to abort an
    // unfinished read in case of errors
    if(nblk>1 || driverError || sdioTransferError || dmaTransferError)
    {
        cr=Command::send(CommandType::CMD12,0);
        if(driverError || dmaTransferError || sdioTransferError)
        {
            // CMD13 is sent to check the real status of the sdio after CMD12
            // and to reset the card in case if it gets stuck in a illegal state
            cr=Command::send(CommandType::CMD13, Command::getRca()<<16);
        }
    }
    if(sdioTransferError || dmaTransferError || cr.validateR1Response()==false)
    {
        displayBlockTransferError();
        ClockController::reduceClockSpeed();
        return false;
    }
    
    //Read ok, deal with cache coherence
    markBufferAfterDmaRead(buffer,nblk*512);
    return true;
}

/**
 * \internal
 * Write a given number of contiguous 512 byte blocks to an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes
 * \param nblk number of blocks to write.
 * \param lba logical block address of the first block to write.
 */
static bool multipleBlockWrite(const unsigned char *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    while(nblk>32767)
    {
        if(multipleBlockWrite(buffer,32767,lba)==false) return false;
        buffer+=32767*512;
        nblk-=32767;
        lba+=32767;
    }
    
    //Deal with cache coherence
    markBufferBeforeDmaWrite(buffer,nblk*512);
    
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    if(nblk>1)
    {
        CmdResult cr=Command::send(CommandType::ACMD23,nblk);
        if(cr.validateR1Response()==false) return false;
    }
    
