fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
    unsigned int memoryTransferSize=dmaTransferCommonSetup(buffer);
    
    //Data transfer is considered complete once the SDIO transfer complete
    //interrupt occurs, that happens when the last data was written to the SDIO
    //Both SDIO and DMA error interrupts are active to catch errors
    uint32_t t=SDIO_MASK_DATAENDIE  | //Interrupt on data end
               SDIO_MASK_RXOVERRIE  | //Interrupt on rx underrun
               SDIO_MASK_TXUNDERRIE | //Interrupt on tx underrun
               SDIO_MASK_DCRCFAILIE | //Interrupt on data CRC fail
               SDIO_MASK_DTIMEOUTIE;  //Interrupt on data timeout
    #ifdef SDIO_MASK_STBITERRIE
    t|=SDIO_MASK_STBITERRIE; //Interrupt on start bit error
    #endif
    SDIO->MASK=t;
    DMA_Stream->PAR=reinterpret_cast<unsigned int>(&SDIO->FIFO);
    DMA_Stream->M0AR=reinterpret_cast<unsigned int>(buffer);
    //Note: DMA_Stream->NDTR is don't care in peripheral flow control mode
    //Quirk: not enabling DMA_SxFCR_FEIE because the SDIO seems to generate
    //a spurious fifo error. The code was tested and the transfer completes
    //successfully even in the presence of this fifo error
    DMA_Stream->FCR = DMA_SxFCR_DMDIS  //Fifo enabled
                    | DMA_SxFCR_FTH_1  //Take action if fifo full
                    | DMA_SxFCR_FTH_0;
#if defined(_CHIP_STM32F7) && SD_SDMMC==2
    DMA_Stream->CR = (11 << DMA_SxCR_CHSEL_Pos) // Channel 4 (SDIO)
#else
    DMA_Stream->CR = DMA_SxCR_CHSEL_2     // Channel 4 (SDIO)
#endif
                   | DMA_SxCR_PBURST_0  //4-beat bursts write to SDIO
                   | DMA_SxCR_PL_0      //Medium priority DMA stream
                   | memoryTransferSize //RAM data size depends on alignment
                   | DMA_SxCR_PSIZE_1   //Write 32bit at a time to SDIO
                   | DMA_SxCR_MINC      //Increment RAM pointer
                   | DMA_SxCR_DIR_0     //Memory to peripheral direction
                   | DMA_SxCR_PFCTRL    //Peripheral is flow controller
                   | DMA_SxCR_TEIE      //Interrupt on transfer error
                   | DMA_SxCR_DMEIE     //Interrupt on direct mode error
                   | DMA_SxCR_EN;       //Start the DMA
    
    SDIO->DLEN=nblk*512;
    if(waiting==0)
    {
        DBGERR("Premature wakeup\n");
        driverError=true;
    }
    CmdResult cr=Command::send(nblk>1 ? CommandType::CMD25 : CommandType::CMD24,lba);
    if(cr.validateR1Response())
    {
        //Block size 512 bytes, block data xfer, from card to controller
        SDIO->DCTRL=(9<<4) | SDIO_DCTRL_DMAEN | SDIO_DCTRL_DTEN;
        FastGlobalIrqLock dLock;
        while(waiting) Thread::IRQglobalIrqUnlockAndWait(dLock);
    } else sdioTransferError=true;
    DMA_Stream->CR=0;
    while(DMA_Stream->CR & DMA_SxCR_EN) ; //DMA may take time to stop
    SDIO->DCTRL=0; //Disable data path state machine
    SDIO->MASK=0;

    // CMD12 is sent to end CMD25 (multiple block write), or to abort an
    // unfinished write in case of errors
    if(nblk>1 || driverError || sdioTransferError || dmaTransferError)
    {
        cr=Command::send(CommandType::CMD12,0);
        if(driverError || dmaTransferError || sdioTransferError)
        {
            // CMD13 is sent to check the real status of the sdio after CMD12
            // and to reset the card in case if it gets stuck in a illegal state
            cr=Command::send(CommandType::CMD13,Command::getRca()<<16);
        }
    }
    if(sdioTransferError || dmaTransferError || cr.validateR1Response()==false)
    {
        displayBlockTransferError();
        ClockController::reduceClockSpeed();
        return false;
    }
    return true;
}

//
// Class CardSelector
//

#ifndef SD_KEEP_CARD_SELECTED
/**
 * \internal
 * Simple RAII class for selecting an SD/MMC card an automatically deselect it
 * at the end of the scope.
 */
class CardSelector
{
public:
    /**
     * \internal
     * Constructor. Selects the card.
     * The result of the select operation is available through its succeded()
     * member function
     */
    explicit CardSelector()
    {
        success=Command::send(
                CommandType::CMD7,Command::getRca()<<16).validateR1Response();
    }

    /**
     * \internal
     * \return true if the card was selected, false on error
     */
    bool succeded() { return success; }

    /**
     * \internal
     * Destructor, ensures that the card is deselected
     */
    ~CardSelector()
    {
        Command::send(CommandType::CMD7,0); //Deselect card. This will timeout
    }

private:
    bool success;
};
#endif //SD_KEEP_CARD_SELECTED

//
// Initialization helper functions
//

/**
 * \internal
 * One-time SDIO setup: clocks, GPIO alternate functions and IRQ registration.
 */
static void initSDIOPeripheralOnce()
{
    //Doing read-modify-write on RCC->APBENR2 and gpios, better be safe
    GlobalIrqLock lock;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN
                  | RCC_AHB1ENR_GPIODEN
                  | RCC_AHB1ENR_DMA2EN;
    RCC_SYNC();
    RCC->APB2ENR |= RCC_APB2ENR_SDIOEN;
    RCC_SYNC();
    #if defined(_CHIP_STM32F7) && SD_SDMMC==2
    sdD0::mode(Mode::ALTERNATE);
    sdD0::alternateFunction(11);
    #ifndef SD_ONE_BIT_DATABUS
    sdD1::mode(Mode::ALTERNATE);
    sdD1::alternateFunction(11);
    sdD2::mode(Mode::ALTERNATE);
    sdD2::alternateFunction(10);
    sdD3::mode(Mode::ALTERNATE);
    sdD3::alternateFunction(10);
    #endif // SD_ONE_BIT_DATABUS
    sdCLK::mode(Mode::ALTERNATE);
    sdCLK::alternateFunction(11);
    sdCMD::mode(Mode::ALTERNATE);
    sdCMD::alternateFunction(11);
    #else
    sdD0::mode(Mode::ALTERNATE);
    sdD0::alternateFunction(12);
    #ifndef SD_ONE_BIT_DATABUS
    sdD1::mode(Mode::ALTERNATE);
    sdD1::alternateFunction(12);
    sdD2::mode(Mode::ALTERNATE);
    sdD2::alternateFunction(12);
    sdD3::mode(Mode::ALTERNATE);
    sdD3::alternateFunction(12);
    #endif // SD_ONE_BIT_DATABUS
    sdCLK::mode(Mode::ALTERNATE);
    sdCLK::alternateFunction(12);
    sdCMD::mode(Mode::ALTERNATE);
    sdCMD::alternateFunction(12);
    #endif

    #if defined(_CHIP_STM32F7) && SD_SDMMC==2
    IRQregisterIrq(lock,DMA2_Stream0_IRQn,SDDMAirqImpl);
    #else
    IRQregisterIrq(lock,DMA2_Stream3_IRQn,SDDMAirqImpl);
    #endif
    IRQregisterIrq(lock,SDIO_IRQn,SDirqImpl);
}

/**
 * \internal
 * Reset and restart the SDIO peripheral state machine.
 */
static void initSDIOPeripheral()
{
    SDIO->POWER=0; //Power off state
    delayUs(1);
    SDIO->CLKCR=0;
    SDIO->CMD=0;
    SDIO->DCTRL=0;
    #if defined(_CHIP_STM32F7)
    SDIO->ICR=0x4005ff;
    #else
    SDIO->ICR=0xc007ff;
    #endif
    SDIO->POWER=SDIO_POWER_PWRCTRL_1 | SDIO_POWER_PWRCTRL_0; //Power on state
    //This delay is particularly important: when setting the POWER register a
    //glitch on the CMD pin happens. This glitch has a fast fall time and a slow
    //rise time resembling an RC charge with a ~6us rise time. If the clock is
    //started too soon, the card sees a clock pulse while CMD is low, and
    //interprets it as a start bit. No, setting POWER to powerup does not
    //eliminate the glitch.
    delayUs(10);
    ClockController::setLowSpeedClock();
    //Wait at least 74 clock cycles before first command
    Thread::nanoSleep(250000);
}

/**
 * \internal
 * Detect if the card is an SDHC, SDv2, SDv1, MMC
 * \return Type of card: (1<<0)=MMC (1<<1)=SDv1 (1<<2)=SDv2 (1<<2)|(1<<3)=SDHC
 * or Invalid if card detect failed.
 */
static CardType detectCardType()
{
    const int INIT_TIMEOUT=200; //200*10ms= 2 seconds
    CmdResult r=Command::send(CommandType::CMD8,0x1aa);
    if(r.validateError())
    {
        //We have an SDv2 card connected
        if(r.getShortResponse()!=0x1aa)
        {
            DBGERR("CMD8 validation: voltage range fail\n");
            return Invalid;
        }
        for(int i=0;i<INIT_TIMEOUT;i++)
        {
            //Bit 30 @ 1 = tell the card we like SDHCs
            r=Command::send(CommandType::ACMD41,(1<<30) | sdVoltageMask);
            //ACMD41 sends R3 as response, whose CRC is wrong.
            if(r.getError()!=CmdResult::Ok && r.getError()!=CmdResult::CRCFail)
            {
                r.validateError();
                return Invalid;
            }
            if((r.getShortResponse() & (1<<31))==0) //Busy bit
            {
                Thread::sleep(10);
                continue;
            }
            if((r.getShortResponse() & sdVoltageMask)==0)
            {
                DBGERR("ACMD41 validation: voltage range fail\n");
                return Invalid;
            }
            DBG("ACMD41 validation: looped %d times\n",i);
            if(r.getShortResponse() & (1<<30))
            {
                DBG("SDHC\n");
                return SDHC;
            } else {
                DBG("SDv2\n");
                return SDv2;
            }
        }
        DBGERR("ACMD41 validation: looped until timeout\n");
        return Invalid;
    } else {
        //We have an SDv1 or MMC
        r=Command::send(CommandType::ACMD41,sdVoltageMask);
        //ACMD41 sends R3 as response, whose CRC is wrong.
        if(r.getError()!=CmdResult::Ok && r.getError()!=CmdResult::CRCFail)
        {
            //MMC card
            DBG("MMC card\n");
            return MMC;
        } else {
            //SDv1 card
            for(int i=0;i<INIT_TIMEOUT;i++)
            {
                //ACMD41 sends R3 as response, whose CRC is wrong.
                if(r.getError()!=CmdResult::Ok &&
                        r.getError()!=CmdResult::CRCFail)
                {
                    r.validateError();
                    return Invalid;
                }
                if((r.getShortResponse() & (1<<31))==0) //Busy bit
                {
                    Thread::sleep(10);
                    //Send again command
                    r=Command::send(CommandType::ACMD41,sdVoltageMask);
                    continue;
                }
                if((r.getShortResponse() & sdVoltageMask)==0)
                {
                    DBGERR("ACMD41 validation: voltage range fail\n");
                    return Invalid;
                }
                DBG("ACMD41 validation: looped %d times\nSDv1\n",i);
                return SDv1;
            }
            DBGERR("ACMD41 validation: looped until timeout\n");
            return Invalid;
        }
    }
}

static off_t getCardSize() {

    CmdResult r=Command::send(CommandType::CMD9,Command::getRca()<<16);    //Get CSD 
    if(r.validateR2Response()==false) return 0;
    auto csdStructure = (r.getLongResponsePart(3) & 0xC0000000) >> 30;
    switch (csdStructure) {
        case 0: {
            DBG("CSD structure version 1.0\n");
            auto cSize  = ((r.getLongResponsePart(2) & 0x000003ff)) << 2 | ((r.getLongResponsePart(1) & 0xC0000000) >> 30);
            DBG("C_SIZE=%8X\n", cSize);
            auto cSizeMult = (r.getLongResponsePart(1) & 0x00038000) >> 15;
            DBG("C_SIZE_MULT=%8X\n", cSizeMult);
            auto readBlLen = (r.getLongResponsePart(2) & 0x000F0000) >> 16;
            DBG("READ_BL_LEN=%8X\n", readBlLen);
            return (cSize + 1) * (1 << (cSizeMult + 2)) * (1 << readBlLen); // (C_SIZE + 1) * 2^(C_SIZE_MULT + 2) * 2^READ_BL_LEN
        }
        case 1: {
            DBG("CSD structure version 2.0\n");
            off_t cSize = (r.getLongResponsePart(1) & 0xffff0000) >> 16 | ((r.getLongResponsePart(2) & 0x0000001f) << 16);
            DBG("C_SIZE=%16llX\n", cSize);
            return (cSize + 1) * (512 * 1024); // (C_SIZE + 1) * 512KB, since C_SIZE is in units of 512KB for CSD version 2.0
        }
        case 2: {
            DBG("CSD structure version 3.0\n");
            off_t cSize = (r.getLongResponsePart(1) & 0xffff0000) >> 16 | ((r.getLongResponsePart(2) & 0x000007ff) << 16);
            DBG("C_SIZE=%16llX\n", cSize);
            return (cSize + 1) * (512 * 1024); // Same formula as CSD version 2.0, but with a larger C_SIZE field
        }
        default:
            DBGERR("Unsupported CSD structure version: %d\n", csdStructure);
            return 0;
    }

