fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f2_f4_f7_sd.cpp
}

//
// class SDIODriver
//

intrusive_ref_ptr<SDIODriver> SDIODriver::instance()
{
    static KernelMutex m;
    static intrusive_ref_ptr<SDIODriver> instance;
    Lock<KernelMutex> l(m);
    if(!instance) instance=new SDIODriver();
    return instance;
}

ssize_t SDIODriver::readBlock(void* buffer, size_t size, off_t where)
{
    if(where % 512 || size % 512) return -EFAULT;
    unsigned int lba=where/512;
    unsigned int nSectors=size/512;
    Lock<KernelMutex> l(mutex);
    DBG("SDIODriver::readBlock(): nSectors=%d\n",nSectors);
    bool goodBuffer=BufferConverter::isGoodBuffer(buffer);
    if(goodBuffer==false) DBG("Buffer inside CCM\n");
    
    for(int i=0;i<ClockController::getRetryCount();i++)
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) continue;
        #endif //SD_KEEP_CARD_SELECTED
        bool error=false;
        
        if(goodBuffer)
        {
            if(multipleBlockRead(reinterpret_cast<unsigned char*>(buffer),
                nSectors,lba)==false) error=true;
        } else {
            //Fallback code to work around CCM
            unsigned char *tempBuffer=reinterpret_cast<unsigned char*>(buffer);
            unsigned int tempLba=lba;
            for(unsigned int j=0;j<nSectors;j++)
            {
                unsigned char* b=BufferConverter::toWordAlignedWithoutCopy(tempBuffer);
                if(multipleBlockRead(b,1,tempLba)==false)
                {
                    error=true;
                    break;
                }
                BufferConverter::toOriginalBuffer();
                tempBuffer+=512;
                tempLba++;
            }
        }
        
        if(error==false)
        {
            if(i>0) DBGERR("Read: required %d retries\n",i);
            return size;
        }
    }
    return -EBADF;
}

ssize_t SDIODriver::writeBlock(const void* buffer, size_t size, off_t where)
{
    if(where % 512 || size % 512) return -EFAULT;
    unsigned int lba=where/512;
    unsigned int nSectors=size/512;
    Lock<KernelMutex> l(mutex);
    DBG("SDIODriver::writeBlock(): nSectors=%d\n",nSectors);
    bool goodBuffer=BufferConverter::isGoodBuffer(buffer);
    if(goodBuffer==false) DBG("Buffer inside CCM\n");
    
    for(int i=0;i<ClockController::getRetryCount();i++)
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) continue;
        #endif //SD_KEEP_CARD_SELECTED
        bool error=false;
        
        if(goodBuffer)
        {
            if(multipleBlockWrite(reinterpret_cast<const unsigned char*>(buffer),
                nSectors,lba)==false) error=true;
        } else {
            //Fallback code to work around CCM
            const unsigned char *tempBuffer=
                reinterpret_cast<const unsigned char*>(buffer);
            unsigned int tempLba=lba;
            for(unsigned int j=0;j<nSectors;j++)
            {
                const unsigned char* b=BufferConverter::toWordAligned(tempBuffer);
                if(multipleBlockWrite(b,1,tempLba)==false)
                {
                    error=true;
                    break;
                }
                tempBuffer+=512;
                tempLba++;
            }
        }
        
        if(error==false)
        {
            if(i>0) DBGERR("Write: required %d retries\n",i);
            return size;
        }
    }
    return -EBADF;
}

int SDIODriver::ioctl(int cmd, void* arg)
{
    DBG("SDIODriver::ioctl()\n");
    if(cmd==IOCTL_REINIT)
        return reinitialize(true) ? 0 : -EFAULT;
    if(cmd!=IOCTL_SYNC) return -ENOTTY;
    Lock<KernelMutex> l(mutex);
    //Note: no need to select card, since status can be queried even with card
    //not selected.
    return waitForCardReady() ? 0 : -EFAULT;
}

bool SDIODriver::sdioReinitLocked()
{
    initSDIOPeripheral();

    // This is more important than it seems, since CMD55 requires the card's RCA
    // as argument. During initalization, after CMD0 the card has an RCA of zero
    // so without this line ACMD41 will fail and the card won't be initialized.
    Command::setRca(0);

    //Send card reset command
    CmdResult r=Command::send(CommandType::CMD0,0);
    if(r.validateError()==false) return false;

    cardType=detectCardType();
    if(cardType==Invalid) return false; //Card detect failed
    if(cardType==MMC) return false; //MMC cards currently unsupported

    // Now give an RCA to the card. In theory we should loop and enumerate all
    // the cards but this driver supports only one card.
    r=Command::send(CommandType::CMD2,0);
    if(r.validateR2Response()==false) return false;

    r=Command::send(CommandType::CMD3,0);
    if(r.validateR6Response()==false) return false;
    Command::setRca(r.getShortResponse()>>16);
    DBG("Got RCA=%u\n",Command::getRca());
    if(Command::getRca()==0)
    {
        //RCA=0 can't be accepted, since it is used to deselect cards
        DBGERR("RCA=0 is invalid\n");
        return false;
    }

    // Here we should be able to get the card's CSD
    cardSize = getCardSize();
    if (cardSize == 0)
    {
        DBGERR("Failed to get card size or card is empty\n");
    } else {
        DBG("Card size: %llu bytes\n", cardSize);
    }

    //Lastly, try selecting the card and configure the latest bits
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) return false;
        #else //SD_KEEP_CARD_SELECTED
        //Select card here, and keep it selected indefinitely
        r=Command::send(CommandType::CMD7,Command::getRca()<<16);
        if(r.validateR1Response()==false) return false;
        #endif //SD_KEEP_CARD_SELECTED

        r=Command::send(CommandType::CMD13,Command::getRca()<<16);//Get status
        if(r.validateR1Response()==false) return false;
        if(r.getState()!=4) //4=Tran state
        {
            DBGERR("CMD7 was not able to select card\n");
            return false;
        }

        #ifndef SD_ONE_BIT_DATABUS
        r=Command::send(CommandType::ACMD6,2);   //Set 4 bit bus width
        if(r.validateR1Response()==false) return false;
        #endif //SD_ONE_BIT_DATABUS
        
        if(cardType!=SDHC)
        {
            r=Command::send(CommandType::CMD16,512); //Set 512Byte block length
            if(r.validateR1Response()==false) return false;
        }
    }

    // Reinitialization restores a defined card state. Clock calibration is
    // left to the caller so it can be requested only when needed.
    return true;
}

bool SDIODriver::reinitialize(bool calibrate)
{
    Lock<KernelMutex> l(mutex);
    if(sdioReinitLocked()==false) return false;
    if(calibrate==false) return true;
    return ClockController::calibrateClockSpeed(this);
}

SDIODriver::SDIODriver() : Device(Device::BLOCK)
{
    initSDIOPeripheralOnce();
    if(reinitialize(true)) DBG("SDIO init: Success\n");
}

} //namespace miosix
